performance_ruby_2_2_0/thin/active_record.txt
      done.
siege aborted due to excessive socket failure; you
can change the failure threshold in $HOME/.siegerc

Transactions:		         862 hits
Availability:		       45.49 %
Elapsed time:		      531.31 secs
Data transferred:	       39.43 MB
Response time:		        6.13 secs
Transaction rate:	        1.62 trans/sec
Throughput:		        0.07 MB/sec
Concurrency:		        9.94
Successful transactions:         862
Failed transactions:	        1033
Longest transaction:	        6.37
Shortest transaction:	        0.02
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.