performance_ruby_2_2_0/thin/pi.txt
      done.

Transactions:		       10000 hits
Availability:		      100.00 %
Elapsed time:		      759.89 secs
Data transferred:	       49.02 MB
Response time:		        0.75 secs
Transaction rate:	       13.16 trans/sec
Throughput:		        0.06 MB/sec
Concurrency:		        9.93
Successful transactions:       10000
Failed transactions:	           0
Longest transaction:	        2.24
Shortest transaction:	        0.07
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.